# Encoding

**Feature Enngineering**

- so far we have performed feature analysis

    - Data Frame quick checks

    - categorical column analysis
    
    - Bar charts, pie charts
    
    - Numerical column analysis
    
    - Histograms, Box Plot, outliers
    
    - Bi-variate, mult variate analysis
    
    - correlation etc
    
- now we need to learn Feature Engeneering

     - we will cretae a new column for better ML models
     
     - we will perform the **Encoding** , which convert the categorical to numerical data
     
     - we will do data **transformation**
     
     - we will perform **Scaling: Stardization** and  **Normalizatio**
     
     - we will perform the **missing value analysis** 
     
- simply feature engineering means our data will be modified

- Feature Analysis

- Faeture Engineering

- Feature Selection

- Model Development

- Model Evaluation--testing

- Model Tuning--for bettre performance

- Model deployment

**Enconding**

- convert categorical data to numerical data

- Ml,Dl or any models works based on mathemathics 

- models cannot understand english characters

- so it very important to convert categorical label to numerical values

- Ex:
    - gender col has 2 labels
    
    - 1.male--1
    - 2.Female--0
- it is based on alphabetical order

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
file_path=r"C:\Users\SNEHA\OneDrive\Desktop\DS_My notes\categorical pro\VisaDataset.csv"
visa_df=pd.read_csv(file_path)
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [3]:
cat=visa_df.select_dtypes(include=['object', 'category']).columns
num=visa_df.select_dtypes(exclude=['object']).columns

In [4]:
cat

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'region_of_employment', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [5]:
num

Index(['no_of_employees', 'yr_of_estab', 'prevailing_wage'], dtype='object')

In [6]:
visa_df['case_status'].unique()

array(['Denied', 'Certified'], dtype=object)

- certified should assign as 0

- denied should assign as 1

In [14]:
#mapping
d={'Certified':0,'Denied':1}
d
#dictionary can assign the values

{'Certified': 0, 'Denied': 1}

In [15]:
visa_df['case_status']

0           Denied
1        Certified
2           Denied
3           Denied
4        Certified
           ...
25475    Certified
25476    Certified
25477    Certified
25478    Certified
25479    Certified
Name: case_status, Length: 25480, dtype: object

In [16]:
visa_df['case_status'].map(d)

0        1
1        0
2        1
3        1
4        0
        ..
25475    0
25476    0
25477    0
25478    0
25479    0
Name: case_status, Length: 25480, dtype: int64

In [17]:
visa_df['case_status']=visa_df['case_status'].map(d)
visa_df['case_status']

0        1
1        0
2        1
3        1
4        0
        ..
25475    0
25476    0
25477    0
25478    0
25479    0
Name: case_status, Length: 25480, dtype: int64

In [19]:
visa_df['continent'].unique()

array(['Asia', 'Africa', 'North America', 'Europe', 'South America',
       'Oceania'], dtype=object)

In [21]:
d={}
d['Asia']=0
d['Africa']=1
d['North America']=2
d['Europe']=3
d['South America']=4
d['Oceani']=5
d

{'Asia': 0,
 'Africa': 1,
 'North America': 2,
 'Europe': 3,
 'South America': 4,
 'Oceani': 5}

In [28]:
labels=visa_df['continent'].unique()
n=len(labels)
d={}
for i in range(n):
    print(labels[i], i)
    d[labels[i]]=i
d

#labels=continet
#i=0,1,2,3...

Asia 0
Africa 1
North America 2
Europe 3
South America 4
Oceania 5

{'Asia': 0,
 'Africa': 1,
 'North America': 2,
 'Europe': 3,
 'South America': 4,
 'Oceania': 5}

In [25]:
labels=sorted(visa_df['continent'].unique())
d={}

for i,j in enumerate(labels):
    d[j]=i
d

{'Africa': 0,
 'Asia': 1,
 'Europe': 2,
 'North America': 3,
 'Oceania': 4,
 'South America': 5}

In [36]:
labels=sorted(visa_df['continent'].unique())
d={j:i for i,j in enumerate(labels)}
visa_df['continent']=visa_df['continent'].map(d)
visa_df['continent']

0        1
1        1
2        1
3        1
4        0
        ..
25475    1
25476    1
25477    1
25478    1
25479    1
Name: continent, Length: 25480, dtype: int64

In [32]:
#step-1

file_path=r"C:\Users\SNEHA\OneDrive\Desktop\DS_My notes\categorical pro\VisaDataset.csv"
visa_df=pd.read_csv(file_path)
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [33]:
#Step-2:
cat=visa_df.select_dtypes(include=['object', 'category']).columns

In [34]:
cat

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'region_of_employment', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [40]:
#step-3:
file_path=r"C:\Users\SNEHA\OneDrive\Desktop\DS_My notes\categorical pro\VisaDataset.csv"
visa_df=pd.read_csv(file_path)

cat=visa_df.select_dtypes(include=['object', 'category']).columns

for i in cat[1:]:
    labels=sorted(visa_df['continent'].unique())
    d={j:i for j,i in enumerate(labels)}
    visa_df[i]=visa_df[i].map(d)

In [41]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,NaN,NaN,NaN,NaN,14513,2007,NaN,592.2029,NaN,NaN,NaN
1,EZYV02,NaN,NaN,NaN,NaN,2412,2002,NaN,83425.6500,NaN,NaN,NaN
2,EZYV03,NaN,NaN,NaN,NaN,44444,2008,NaN,122996.8600,NaN,NaN,NaN
3,EZYV04,NaN,NaN,NaN,NaN,98,1897,NaN,83434.0300,NaN,NaN,NaN
4,EZYV05,NaN,NaN,NaN,NaN,1082,2005,NaN,149907.3900,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,NaN,NaN,NaN,NaN,2601,2008,NaN,77092.5700,NaN,NaN,NaN
25476,EZYV25477,NaN,NaN,NaN,NaN,3274,2006,NaN,279174.7900,NaN,NaN,NaN
25477,EZYV25478,NaN,NaN,NaN,NaN,1121,1910,NaN,146298.8500,NaN,NaN,NaN
25478,EZYV25479,NaN,NaN,NaN,NaN,1918,1887,NaN,86154.7700,NaN,NaN,NaN
25479,EZYV25480,NaN,NaN,NaN,NaN,3195,1960,NaN,70876.9100,NaN,NaN,NaN

**Label Encoder**

- label encoder is a method convert cat labels to numerical values

- it is under package: **sklearn(scikit-learn)**
    
    - The class name : **Preprocessing**
        
        - method name : **label encoder**

In [39]:
#from <package>.<class> import <method>

from sklearn.preprocessing import LabelEncoder

- Step-1: import the method

- Step-2: save the method

- Step-3: apply fit transform
    
- **Fit transform**

    - **fit** means find the logic

    - in above example fit means carete mapper or dict
    
- **Transform** 
    - means apply the logic and change the data
    
    - apply the mapper on the data

In [44]:
file_path=r"C:\Users\SNEHA\OneDrive\Desktop\DS_My notes\categorical pro\VisaDataset.csv"
visa_df=pd.read_csv(file_path)

cat=visa_df.select_dtypes(include=['object', 'category']).columns

#import the method

from sklearn.preprocessing import LabelEncoder

# save the method
le=LabelEncoder()

# apply fit transform
visa_df['case_status']=le.fit_transform(visa_df['case_status'])
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,0
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,0
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,0
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,0
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,0

In [53]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
visa_df['continent']=le.fit_transform(visa_df['continent'])
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,1,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,1,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,1,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,0,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,1,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,1,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,1,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,1,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [47]:
file_path=r"C:\Users\SNEHA\OneDrive\Desktop\DS_My notes\categorical pro\VisaDataset.csv"
visa_df=pd.read_csv(file_path)

cat=visa_df.select_dtypes(include=['object', 'category']).columns

for i in cat[1:]:
    from sklearn.preprocessing import LabelEncoder

    # save the method
    le=LabelEncoder()

    # apply fit transform
    visa_df[i]=le.fit_transform(visa_df[i])
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,2,0,0,14513,2007,4,592.2029,0,1,1
1,EZYV02,1,3,1,0,2412,2002,2,83425.6500,3,1,0
2,EZYV03,1,0,0,1,44444,2008,4,122996.8600,3,1,1
3,EZYV04,1,0,0,0,98,1897,4,83434.0300,3,1,1
4,EZYV05,0,3,1,0,1082,2005,3,149907.3900,3,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,0,1,1,2601,2008,3,77092.5700,3,1,0
25476,EZYV25477,1,2,1,0,3274,2006,2,279174.7900,3,1,0
25477,EZYV25478,1,3,1,0,1121,1910,3,146298.8500,3,0,0
25478,EZYV25479,1,3,1,1,1918,1887,4,86154.7700,3,1,0
25479,EZYV25480,1,0,1,0,3195,1960,1,70876.9100,3,1,0

**One-heart Encoders**

- first how many labels are there in acolumn

- what are they
- that many columns will be craeted extra

for ex: case_status  has 2 labels
    
    - Certified
    
    - Denied
- so at a time it will carete two new extra columns
    - case_status_certied
    - case_status_denied

|case_status|case_status_Certified|case_status_Denied|
|-|-|-|
|Certified|1|0
|Denied|0|1
|Denied|0|1
|Certified|1|0

In [49]:
#continent        C_A     C_Af      C_E
#Asia             1          0       0
#Africa           0          1       0
#Europe           0          0       1

**pd.get_dummies**

In [50]:
file_path=r"C:\Users\SNEHA\OneDrive\Desktop\DS_My notes\categorical pro\VisaDataset.csv"
visa_df=pd.read_csv(file_path)

cat=visa_df.select_dtypes(include=['object', 'category']).columns

pd.get_dummies(visa_df['continent'])

       Africa  Asia  Europe  North America  Oceania  South America
0           0     1       0              0        0              0
1           0     1       0              0        0              0
2           0     1       0              0        0              0
3           0     1       0              0        0              0
4           1     0       0              0        0              0
...       ...   ...     ...            ...      ...            ...
25475       0     1       0              0        0              0
25476       0     1       0              0        0              0
25477       0     1       0              0        0              0
25478       0     1       0              0        0              0
25479       0     1       0              0        0              0

[25480 rows x 6 columns]

In [51]:
pd.get_dummies(visa_df['case_status'])

       Certified  Denied
0              0       1
1              1       0
2              0       1
3              0       1
4              1       0
...          ...     ...
25475          1       0
25476          1       0
25477          1       0
25478          1       0
25479          1       0

[25480 rows x 2 columns]

In [52]:
pd.get_dummies(visa_df['case_status'],dtype=int)

       Certified  Denied
0              0       1
1              1       0
2              0       1
3              0       1
4              1       0
...          ...     ...
25475          1       0
25476          1       0
25477          1       0
25478          1       0
25479          1       0

[25480 rows x 2 columns]

## 12/12/2025